In [214]:
import simplejson as json
import psycopg2 as psy
import pandas.io.sql as psql
import pandas as pd
import feather
from datetime import datetime

In [215]:
conexion_json = json.loads(open('secret_conexion_2.json').read())

In [216]:
conexion_json

{'dbname': 'test', 'host': '192.168.0.10', 'password': 'test', 'user': 'test'}

In [217]:
with open('secret_conexion_2.json') as conex_json:
    parametros = json.load(conex_json)
    host = parametros['host']
    dbname = parametros['dbname']
    user = parametros['user']
    password = parametros['password']

In [225]:
con = psy.connect(host=host, dbname=dbname, user=user, password=password)

In [226]:
resultado = psql.read_sql("select pid, datname, usename , application_name, client_addr, state, query_start, query from pg_catalog.pg_stat_activity limit 10;", con)

In [227]:
resultado

,pid,datname,usename,application_name,client_addr,state,query_start,query
0,1111,None,postgres,,None,None,NaT,
1,1109,None,None,,None,None,NaT,
2,12768,test,test,,192.168.0.10,active,2020-09-17 20:59:24.583905+00:00,"select pid, datname, usename , application_nam..."
3,1107,None,None,,None,None,NaT,
4,1106,None,None,,None,None,NaT,
5,1108,None,None,,None,None,NaT,

In [228]:
tabla_df = pd.DataFrame(query,columns=['pid', 'datname', 'usename' , 'application_name', 'client_addr', 'state', 'query_start', 'query'])

In [229]:
tabla_df

,pid,datname,usename,application_name,client_addr,state,query_start,query
0,1111,None,postgres,,None,None,NaT,
1,1109,None,None,,None,None,NaT,
2,6873,test,test,,192.168.0.10,active,2020-09-17 18:50:12.209516+00:00,"select pid, datname, usename , application_nam..."
3,1107,None,None,,None,None,NaT,
4,1106,None,None,,None,None,NaT,
5,1108,None,None,,None,None,NaT,

In [230]:
tabla_feather = pd.DataFrame(data=tabla_df)

In [231]:
tabla_feather

,pid,datname,usename,application_name,client_addr,state,query_start,query
0,1111,None,postgres,,None,None,NaT,
1,1109,None,None,,None,None,NaT,
2,6873,test,test,,192.168.0.10,active,2020-09-17 18:50:12.209516+00:00,"select pid, datname, usename , application_nam..."
3,1107,None,None,,None,None,NaT,
4,1106,None,None,,None,None,NaT,
5,1108,None,None,,None,None,NaT,

In [232]:
raizFeather = "pg_stat_activity_"

In [213]:
fecha = datetime.now()

In [205]:
f"{raizFeather}{fecha}"

'pg_stat_activity_2020-09-17'

In [206]:
tabla_feather.to_feather(f"{raizFeather}{fecha}")

In [207]:
leer_frame = pd.read_feather(f"{raizFeather}{fecha}")

In [208]:
leer_frame

,pid,datname,usename,application_name,client_addr,state,query_start,query
0,1111,None,postgres,,None,None,NaT,
1,1109,None,None,,None,None,NaT,
2,6873,test,test,,192.168.0.10,active,2020-09-17 18:50:12.209516+00:00,"select pid, datname, usename , application_nam..."
3,1107,None,None,,None,None,NaT,
4,1106,None,None,,None,None,NaT,
5,1108,None,None,,None,None,NaT,

datetime.datetime(2020, 9, 17, 17, 58, 20, 402737)